Repository: hason/MinkExtension
Catalog: i18n/*.xliff
Languages: cs

# i-am-homepage
source: /^(?:|I )am on (?:|the )homepage$/
cs: /^(?:|se )(?:jsem|nacházím)(?:| se) na (?:homepage|hlavní stránce)$/

# i-go-to-homepage
source: /^(?:|I )go to (?:|the )homepage$/
cs: /^(?:|se )(?:|pře|pů)jd[ue](?:| se) na (?:homepage|hlavní stránku)$/

# i-am-on-page
source: /^(?:|I )am on "(?P<page>[^"]+)"$/
cs: /^(?:|se )(?:jsem|nacházím)(?:| se) na(?:| stránce|(?:| url)(?:| adrese)) "(?P<page>[^"]+)"$/

# i-go-to-page
source: /^(?:|I )go to "(?P<page>[^"]+)"$/
cs: /^(?:|se )(?:|pře|pů)jd[ue](?:| se) na(?:| stránku|(?:| url)(?:| adresu)) "(?P<page>[^"]+)"$/

# reload-the-page
source: /^(?:|I )reload the page$/
cs: /^(?:|se )(?:|znovu )(?:|se )(?:obnovím?|(?:|pře)načt[ue])(?:| se)(?:| aktuální) stránk[au]$/

# move-backward-one-page
source: /^(?:|I )move backward one page$/
cs: /^(?:|se )(?:vrátím?|(?:|pře|pů)jd[ue])(?:| se)(?:(?:| o(?:| jednu) stránku) (?:|na)zpět| na předchozí stránku)$/

# move-forward-one-page
source: /^(?:|I )move forward one page$/
cs: /^(?:|se )(?:|pře|pů)jd[ue](?:| se)(?:| o(?:| jednu) stránku) (?:vpřed|dopředu)$/

# i-press-button
source: /^(?:|I )press "(?P<button>(?:[^"]|\\")*)"$/
cs: /^(?:|se )(?:klikn[ue]|stiskn[ue]|potvrdím?)(?:| se)(?:|(?:| na) tlačítko) "(?P<button>(?:[^"]|\\")*)"$/

# i-follow-link
source: /^(?:|I )follow "(?P<link>(?:[^"]|\\")*)"$/
cs: /^(?:|se )(?:klikn[ue])(?:| se) na(?:| odkaz| link) "(?P<link>(?:[^"]|\\")*)"$/

# i-fill-in-field-with-value
source: /^(?:|I )fill in "(?P<field>(?:[^"]|\\")*)" with "(?P<value>(?:[^"]|\\")*)"$/
cs: /^(?:|se )(?:zadá(?:|m| se) do|vyplní(?:|m| se))(?:|(?:| formulářové(?:|ho)) (?:pole|políčk[ao])) "(?P<field>(?:[^"]|\\")*)" (?:hodnot(?:u|a|ou)|text(?:|em)) "(?P<value>(?:[^"]|\\")*)"$/

# i-fill-in-value-for-field
source: /^(?:|I )fill in "(?P<value>(?:[^"]|\\")*)" for "(?P<field>(?:[^"]|\\")*)"$/
cs: /^(?:|se )zadá(?:|m| se)(?:| hodnot[ua]| text) "(?P<value>(?:[^"]|\\")*)" do(?:|(?:| formulářového) (?:políčka|pole)) "(?P<field>(?:[^"]|\\")*)"$/

source: /^(?:|I )fill in the following:$/
cs: /^(?:|se )(?:|takto (?:|se ))vyplní(?:| se|m) formulář(?:| následovně):$/

# i-select-option-from-select
source: /^(?:|I )select "(?P<option>(?:[^"]|\\")*)" from "(?P<select>(?:[^"]|\\")*)"$/
cs: /^(?:|se )(?:vyber[ue]|zvolím?)(?:| se)(?:| možnost| položk[au]) "(?P<option>(?:[^"]|\\")*)" z(?:| výběrov(?:u|é|ého)| formulářové(?:|ho)| rozbalovací(?:|ho))(?:| nabídky| pol(?:e|íčka)| menu) "(?P<select>(?:[^"]|\\")*)"$/

# i-additionally-select-option-from-select
source: /^(?:|I )additionally select "(?P<option>(?:[^"]|\\")*)" from "(?P<select>(?:[^"]|\\")*)"$/
cs: /^(?:|(?:|se )zároveň )(?:|se )ještě(?:| se) (?:vyber[ue]|zvolím?)(?:| možnost| položk[au]) "(?P<option>(?:[^"]|\\")*)" z(?:| výběrov(?:u|é|ého)| formulářové(?:|ho)| rozbalovací(?:|ho))(?:| nabídky| pol(?:e|íčka)| menu) "(?P<select>(?:[^"]|\\")*)"$/

# i-check-option
source: /^(?:|I )check "(?P<option>(?:[^"]|\\")*)"$/
cs: /^(?:|se )(?:zaškrtn[ue]|označím?)(?:| se) "(?P<option>(?:[^"]|\\")*)"$/

# i-uncheck-option
source: /^(?:|I )uncheck "(?P<option>(?:[^"]|\\")*)"$/
cs: /^(?:|se )(?:odškrtn[ue]|odznačím?)(?:| se) "(?P<option>(?:[^"]|\\")*)"$/

# i-attach-the-file-to-field
source: /^(?:|I )attach the file "(?P<path>[^"]*)" to "(?P<field>(?:[^"]|\\")*)"$/
cs: /^(?:|se )(?:nahraj[iue]|zadám?|vyber[ue])(?:| se) soubor "(?P<path>[^"]*)" do(?:| políčka) "(?P<field>(?:[^"]|\\")*)"$/

# i-should-see-text
source: /^(?:|I )should see "(?P<text>(?:[^"]|\\")*)"$/
cs: /^(?:|by |bych )(?:|se )(?:měl[ao]?(?:| by| bych)|musím?)(?:| se| být) (?:u?vidět|zobraz(?:en|ena|it)|ukázat)(?:| text| hlášk[au]| zpráv[au]) "(?P<text>(?:[^"]|\\")*)"$/

# i-should-see-text-matching
source: /^(?:|I )should see text matching (?P<pattern>"(?:[^"]|\\")*")$/
cs: /^(?:|by |bych )(?:|se )(?:měl[ao]?(?:| by| bych)|musím?)(?:| se| být) (?:u?vidět|zobraz(?:en|ena|it)|ukázat) (?:text|hlášk[au]|zpráv[au]) (?:odpovídající|vyhovující)(?:| vzoru| předpisu) "(?P<text>(?:[^"]|\\")*)"$/

# i-should-not-see-text-matching
source: /^(?:|I )should not see text matching (?P<pattern>"(?:[^"]|\\")*")$/
cs: /^(?:|by |bych )(?:|se )(?:neměl[ao]?(?:| by)|nesmím?)(?:| se| být) (?:u?vidět|zobraz(?:en|ena|it)|ukázat) (?:text|hlášk[au]|zpráv[au]) (?:odpovídající|vyhovující)(?:| vzoru| předpisu) "(?P<text>(?:[^"]|\\")*)"$/

# the-response-should-contain
source: /^the response should contain "(?P<text>(?:[^"]|\\")*)"$/
cs: /^(?:|by )(?:|vrácená )(?:stránka|odpověď) (?:(?:|by )měla|musí) obsahovat(?:| text) "(?P<text>(?:[^"]|\\")*)"$/

# i-should-not-see-text
source: /^(?:|I )should not see "(?P<text>(?:[^"]|\\")*)"$/
cs: /^(?:by | bych)(?:|se )(?:neměl[ao]?(?:| by)|nesmím?)(?:| se| být) (?:(?:|u)vidět|zobraz(?:en|ena|it)|ukázat)(?:| text| hlášk(?:a|u)| zpráv(?:a|u)) "(?P<text>(?:[^"]|\\")*)"$/

# the-response-should-not-contain
source: /^the response should not contain "(?P<text>(?:[^"]|\\")*)"$/
cs: /^(?:|by )(?:|vrácená )(?:stránka|odpověď) (?:(?:|by )neměla|nesmí) obsahovat(?:| text) "(?P<text>(?:[^"]|\\")*)"$/

# the-field-should-contain-value
source: /^the "(?P<field>(?:[^"]|\\")*)" field should contain "(?P<value>(?:[^"]|\\")*)"$/
cs: /^(?:|by )(?:|formulářové )(?:pole|políčko) "(?P<field>(?:[^"]|\\")*)" (?:obsahuje|(?:|(?:|by )mělo|musí) obsahovat)(?:| text| hodnotu) "(?P<value>(?:[^"]|\\")*)"$/

# the-field-should-not-contain-value
source: /^the "(?P<field>(?:[^"]|\\")*)" field should not contain "(?P<value>(?:[^"]|\\")*)"$/
cs: /(?:|by )(?:|formulářové )(?:pole|políčko) "(?P<field>(?:[^"]|\\")*)" (?:neobsahuje|(?:(?:|by )nemělo|nesmí) obsahovat)(?:| text| hodnotu) "(?P<value>(?:[^"]|\\")*)"$/

# the-checkbox-should-be-checked
source: /^the "(?P<checkbox>(?:[^"]|\\")*)" checkbox should be checked$/
cs: /^(?:|by )(?:|zaškrtávací )(?:pole|políčko|checkbox) "(?P<checkbox>(?:[^"]|\\")*)" (?:je|(?:|by )mělo? být|musí být) (?:zaškrtnuto|označeno)$/

# the-checkbox-should-not-be-checked
source: /^the "(?P<checkbox>(?:[^"]|\\")*)" checkbox should not be checked$/
cs: /^(?:|by )(?:|zaškrtávací )(?:pole|políčko|checkbox) "(?P<checkbox>(?:[^"]|\\")*)" (?:není|(?:|by )nemělo? být|nesmí být) (?:zaškrtnuto|označeno)$/

# i-should-be-on-page
source: /^(?:|I )should be on "(?P<page>[^"]+)"$/
cs: /^(?:bych )(?:|se )(?:měla?|musím)(?:bych )(?: být| (?:|se )nacházet) na(?:| stránce) "(?P<page>[^"]+)"$/

# the-url-should-match
source: /^the (?i)url(?-i) should match (?P<pattern>"([^"]|\\")*")$/
cs: /^(?:url|adresa|url adresa) musí mít tvar (?P<pattern>"([^"]|\\")*")$/

# the-element-should-contain
source: /^the "(?P<element>[^"]*)" element should contain "(?P<value>(?:[^"]|\\")*)"$/
cs: /^element "(?P<element>[^"]*)" musí obsahovat "(?P<value>(?:[^"]|\\")*)"$/

# the-element-should-not-contain
source: /^the "(?P<element>[^"]*)" element should not contain "(?P<value>(?:[^"]|\\")*)"$/
cs: /^элемент "(?P<element>[^"]*)" не должен содержать "(?P<value>(?:[^"]|\\")*)"$/

# i-should-see-text-in-element
source: /^(?:|I )should see "(?P<text>(?:[^"]|\\")*)" in the "(?P<element>[^"]*)" element$/
cs: /^(?:by(?:|ch) měl[ao]?| musím?)(?:| být) (u?vidět|zobraz(?:it|en))(?:| text) "(?P<text>(?:[^"]|\\")*)" uvnitř elementu "(?P<element>[^"]*)"$/

# i-should-not-see-text-in-element
source: /^(?:|I )should not see "(?P<text>(?:[^"]|\\")*)" in the "(?P<element>[^"]*)" element$/
cs: /^(?:|я )не должен видеть "(?P<text>(?:[^"]|\\")*)" внутри элемента "(?P<element>[^"]*)"$/

# i-should-see-element
source: /^(?:|I )should see an? "(?P<element>[^"]*)" element$/
cs: /^(?:(?:by|bych)(?:|se) měl[ao]?|musím?)(?:| být) (?:u?vidět|zobraz(?:en|it)|ukázat) element "(?P<element>[^"]*)"$/

# i-should-not-see-element
source: /^(?:|I )should not see an? "(?P<element>[^"]*)" element$/
cs: /^(?:by(?:|ch)(?:| se) neměl[ao]?|nesmím?)(?:| být) (?:u?vidět|zobraz(?:en|it)|ukázat) element "(?P<element>[^"]*)"$/

# i-should-see-num-elements
source: /^(?:|I )should see (?P<num>\d+) "(?P<element>[^"]*)" elements?$/
cs: /^(?:by(?:|ch)(?:| se) měl[ao]?|musím?)(?:| být) (?:u?vidět|zobrazen[oy]?|zobrazit|ukázat) (?P<num>\d+) element[yů]? "(?P<element>[^"]*)"$/

# the-response-status-code-should-be
source: /^the response status code should be (?P<code>\d+)$/
cs: /^(?:|(?:|stavový )kód )odpově(?:di|ď)(?:| serveru) (?:je|by měl(?:|a) být|musí být) (?P<code>\d+)$/

# the-response-status-code-should-not-be
source: /^the response status code should not be (?P<code>\d+)$/
cs: /^(?:|(?:|stavový )kód )odpově(?:di|ď)(?:| serveru) (?:není|by neměl(?:|a) být|nesmí být) (?P<code>\d+)$/

source: /^print last response$/
cs: /^vypiš poslední (?:odpověď|stránk[au])$/

source: /^show last response$/
cs: /^(?:zobraz|ukaž) poslední (?:odpověď|stránk[au])$/
